let a = '11-12-2025'

let c = a.split('-')

let b = []

for (i in c){
    b.push(int(i))
}

if(b[1]<12 && b[2]<2025){
    if(((b[1]==1 || b[1]==3 || b[1]==5 || b[1]==7 || b[1]==8 || b[1]==10 || b[1]==12)&& b[0]<=31) ||((b[1]==2 || b[1]==4 || b[1]==6 || b[1]==9 || b[1]==11) && b[0]<=30 )){
        if((b[2]%4==0 && b[2]%100!=0)||b[2]%400==0){
            console.log('Дата существует, год високосный')
        }
        else{
            console.log('Дата существует, год невисокосный')
        }
    }
    else{
        console.log('Дата не существует')
    }
}
else{
        console.log('Дата не существует')
    }

